Revit 2027 API
ColorOptions.SelectionColor Property
 The color of the current canvas theme used to highlight selected elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SelectionColor { get; set; }
Public Property SelectionColor As Color
	Get
	Set
public:
property Color^ SelectionColor {
	Color^ get ();
	void set (Color^ value);
}
member SelectionColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace